
// задание 2 Запросите у пользователя его имя. Выведите в окошке (с помощью функции alert) фразу: Привет, Николай! (вместо Николай должно показываться имя, которое ввел пользователь)
let degree = prompt('Назовите стпень');
alert((number ** degree));
let userName = prompt('Как вас зовут?');
alert('Привет, ' + userName);
 
// Задание 3 Запросите у пользователя число. Затем запросите степень, в которую нужно возвести это число. Выведите в консоль результат.
let number = prompt('Назовите число');
let degree = prompt('Назовите стпень');

alert((number ** degree));